In [1]:
import numpy as np
import pandas as pd

##### Creation Date:
##### January 30 2022
##### Created By Alperen KOLAMUC

#### Data

In [2]:
df = pd.read_csv("student.csv")

#### Map
* Series'lerde çalışır

In [3]:
df

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Sinan    Engin   48     105
3      Fırat  Aydınus   42     216

In [4]:
df["name"]

0      Alperen
1    Cristiano
2        Sinan
3        Fırat
Name: name, dtype: object

In [10]:
df["name"].map({"Sinan":"Ahmet"})

0      NaN
1      NaN
2    Ahmet
3      NaN
Name: name, dtype: object

#### Replace
* Sadece belirtilen yere etki eder

In [6]:
df

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Sinan    Engin   48     105
3      Fırat  Aydınus   42     216

In [11]:
df["name"]

0      Alperen
1    Cristiano
2        Sinan
3        Fırat
Name: name, dtype: object

In [12]:
df["name"].replace({"Alperen":"Ahmet"})

0        Ahmet
1    Cristiano
2        Sinan
3        Fırat
Name: name, dtype: object